# Ex1 - Filtering and Sorting Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [84]:
import pandas as pd 
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [85]:
chipo = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv", sep="\t")
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### Step 4. How many products cost more than $10.00?

In [86]:
chipo.item_price = chipo.item_price.apply(lambda x: float(x[1:]))
chipo[chipo.item_price/chipo.quantity > 10].item_name.count()

1034

### Step 5. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [91]:
quantity_one = chipo[chipo.quantity == 1]
new = quantity_one[["item_name", "item_price"]].copy()
new.sort_values(by=["item_price"])

             item_name  item_price
3020       Canned Soda        1.09
3021     Bottled Water        1.09
3793       Canned Soda        1.09
3221       Canned Soda        1.09
2826       Canned Soda        1.09
...                ...         ...
2957  Steak Salad Bowl       11.89
1311  Steak Salad Bowl       11.89
606   Steak Salad Bowl       11.89
4313  Steak Salad Bowl       11.89
3120  Steak Salad Bowl       11.89

[4355 rows x 2 columns]

### Step 6. Sort by the name of the item

In [94]:
new.sort_values(by=["item_name"])

              item_name  item_price
1392  6 Pack Soft Drink        6.49
1260  6 Pack Soft Drink        6.49
3766  6 Pack Soft Drink        6.49
1279  6 Pack Soft Drink        6.49
3693  6 Pack Soft Drink        6.49
...                 ...         ...
2384  Veggie Soft Tacos        8.75
781   Veggie Soft Tacos        8.75
1395  Veggie Soft Tacos        8.49
2851  Veggie Soft Tacos        8.49
738   Veggie Soft Tacos       11.25

[4355 rows x 2 columns]

### Step 7. What was the quantity of the most expensive item ordered?

In [97]:
chipo.sort_values(by = "item_price", ascending = False).head(1)

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

### Step 8. How many times was a Veggie Salad Bowl ordered?

In [99]:
chipo[chipo.item_name == "Veggie Salad Bowl"].quantity.sum()

18

### Step 9. How many times did someone order more than one Canned Soda?

In [100]:
chipo[(chipo.item_name == "Canned Soda") & (chipo.quantity > 1)].order_id.count()

20